---
kind: method
id: M:Autodesk.Revit.DB.ExternallyTaggedNonBReps.Dispose
source: html/acad1f4b-afa3-1b16-fa13-5b65dce65c2e.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBReps.Dispose Method

Releases all resources used by the ExternallyTaggedNonBReps

## Syntax (C#)
```csharp
public void Dispose()
```